Model: "cnn_13_drop_out_0.25"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2D (Conv2D)              (None, 64, 64, 32)        896       
_________________________________________________________________
pooling (MaxPooling2D)       (None, 32, 32, 32)        0         
_________________________________________________________________
conv2D_2 (Conv2D)            (None, 32, 32, 64)        18496     
_________________________________________________________________
pooling_2 (MaxPooling2D)     (None, 16, 16, 64)        0         
_________________________________________________________________
conv2D_3 (Conv2D)            (None, 16, 16, 128)       73856     
_________________________________________________________________
pooling_3 (MaxPooling2D)     (None, 8, 8, 128)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 128)         0         
_________________________________________________________________
flatten (Flatten)            (None, 8192)              0         
_________________________________________________________________
dense_hidden (Dense)         (None, 1024)              8389632   
_________________________________________________________________
dense_hidden_2 (Dense)       (None, 128)               131200    
_________________________________________________________________
ouput (Dense)                (None, 1)                 129       
=================================================================
Total params: 8,614,209
Trainable params: 8,614,209
Non-trainable params: 0
_________________________________________________________________